In [1]:
# import Libraries
import pandas as pd
import sweetviz as sv
import numpy as np
import os
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
df_gender_suicide=pd.read_excel(r"C:\Users\drmat\OneDrive\Documents\Career Foundry\COVID_Suicide\02 Data\01 Raw\Suicide\Gender-Public Health Impact Suicide.xlsx",index_col=False)

In [3]:
df_gender_suicide.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 308 entries, 0 to 307
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            308 non-null    int64
 1   state           308 non-null    object
 2   sex             308 non-null    object
 3   suicide_deaths  308 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 9.8+ KB

In [4]:
df_gender_suicide.head()

   year    state     sex  suicide_deaths
0  2019  Alabama  Female             6.0
1  2019  Alabama    Male            29.6
2  2019   Alaska  Female            11.6
3  2019   Alaska    Male            42.0
4  2019  Arizona  Female             8.9

In [5]:
df_gender_covid=pd.read_excel(r"C:\Users\drmat\OneDrive\Documents\Career Foundry\COVID_Suicide\02 Data\02 Prepared\COVID\gender_pivot.xlsx",index_col=False)

In [6]:
df_gender_covid.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 456 entries, 0 to 455
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   year         456 non-null    int64
 1   state        456 non-null    object
 2   sex          456 non-null    object
 3   covid_cases  456 non-null    int64
dtypes: int64(2), object(2)
memory usage: 14.4+ KB

In [7]:
df_gender_covid.head()

   year    state      sex  covid_cases
0  2020  Alabama   Female       188125
1  2020  Alabama     Male       149248
2  2020  Alabama  Unknown        22172
3  2020   Alaska   Female        21945
4  2020   Alaska     Male        23914

In [8]:
# remove Unknown to match other dataframes
df_gender_covid.drop(df_gender_covid.index[df_gender_covid['sex']=='Unknown'],inplace=True)
df_gender_covid.reset_index(inplace=True)

In [9]:
df_gender_covid.drop(columns=['index'],inplace=True)

In [10]:
df_gender_covid.head()

   year    state     sex  covid_cases
0  2020  Alabama  Female       188125
1  2020  Alabama    Male       149248
2  2020   Alaska  Female        21945
3  2020   Alaska    Male        23914
4  2020  Arizona  Female       299552

In [11]:
df=df_gender_suicide.merge(df_gender_covid,on=['year','state','sex'],how='outer')

In [12]:
df.head()

   year    state     sex  suicide_deaths  covid_cases
0  2019  Alabama  Female             6.0          NaN
1  2019  Alabama    Male            29.6          NaN
2  2019   Alaska  Female            11.6          NaN
3  2019   Alaska    Male            42.0          NaN
4  2019  Arizona  Female             8.9          NaN

In [13]:
df.tail()

     year          state     sex  suicide_deaths  covid_cases
405  2022  West Virginia    Male             NaN         11.0
406  2022      Wisconsin  Female             NaN     201224.0
407  2022      Wisconsin    Male             NaN     167699.0
408  2022        Wyoming  Female             NaN      15565.0
409  2022        Wyoming    Male             NaN      13329.0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 410 entries, 0 to 409
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            410 non-null    int64
 1   state           410 non-null    object
 2   sex             410 non-null    object
 3   suicide_deaths  308 non-null    float64
 4   covid_cases     303 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 19.2+ KB

In [15]:
df.to_excel(r'C:\Users\drmat\OneDrive\Documents\Career Foundry\COVID_Suicide\02 Data\02 Prepared\Combined\sex2.xlsx')